var cityPosition = [
  {
    "name": "北京",
    "lng": 116.28,
    "lat": 39.54
  },
  {
    "name": "青岛",
    "lng": 120.19,
    "lat": 36.04
  },
  {
    "name": "天津",
    "lng": 117.1,
    "lat": 39.1
  },
  {
    "name": "郑州",
    "lng": 113.42,
    "lat": 34.44
  },
  {
    "name": "石家庄",
    "lng": 114.26,
    "lat": 38.03
  },
  {
    "name": "开封",
    "lng": 114.23,
    "lat": 34.52
  },
  {
    "name": "保定",
    "lng": 115.28,
    "lat": 38.53
  },
  {
    "name": "洛阳",
    "lng": 112.26,
    "lat": 34.43
  },
  {
    "name": "唐山",
    "lng": 118.09,
    "lat": 39.37
  },
  {
    "name": "许昌",
    "lng": 113.48,
    "lat": 34
  },
  {
    "name": "秦皇岛",
    "lng": 119.37,
    "lat": 39.54
  },
  {
    "name": "新乡",
    "lng": 113.54,
    "lat": 35.18
  },
  {
    "name": "张家口",
    "lng": 114.55,
    "lat": 40.51
  },
  {
    "name": "武汉",
    "lng": 114.2,
    "lat": 30.37
  },
  {
    "name": "承德",
    "lng": 117.52,
    "lat": 40.59
  },
  {
    "name": "宜昌",
    "lng": 111.15,
    "lat": 30.42
  },
  {
    "name": "太原",
    "lng": 112.33,
    "lat": 37.51
  },
  {
    "name": "沙市",
    "lng": 112.17,
    "lat": 30.16
  },
  {
    "name": "大同",
    "lng": 113.13,
    "lat": 40.07
  },
  {
    "name": "长沙",
    "lng": 112.55,
    "lat": 28.12
  },
  {
    "name": "临汾",
    "lng": 111.31,
    "lat": 36.05
  },
  {
    "name": "衡阳",
    "lng": 112.34,
    "lat": 26.55
  },
  {
    "name": "长治",
    "lng": 113.13,
    "lat": 36.05
  },
  {
    "name": "湘潭",
    "lng": 112.51,
    "lat": 27.54
  },
  {
    "name": "呼和浩特",
    "lng": 111.38,
    "lat": 40.48
  },
  {
    "name": "常德",
    "lng": 111.39,
    "lat": 29
  },
  {
    "name": "包头",
    "lng": 110,
    "lat": 40.35
  },
  {
    "name": "广州",
    "lng": 113.18,
    "lat": 23.1
  },
  {
    "name": "海拉尔",
    "lng": 119.43,
    "lat": 49.14
  },
  {
    "name": "汕头",
    "lng": 116.4,
    "lat": 23.21
  },
  {
    "name": "沈阳",
    "lng": 123.23,
    "lat": 41.48
  },
  {
    "name": "韶关",
    "lng": 113.33,
    "lat": 24.48
  },
  {
    "name": "大连",
    "lng": 121.38,
    "lat": 38.54
  },
  {
    "name": "海口",
    "lng": 110.1,
    "lat": 20.03
  },
  {
    "name": "鞍山",
    "lng": 123,
    "lat": 41.04
  },
  {
    "name": "南宁",
    "lng": 108.21,
    "lat": 22.47
  },
  {
    "name": "锦州",
    "lng": 121.09,
    "lat": 41.09
  },
  {
    "name": "桂林",
    "lng": 110.1,
    "lat": 25.18
  },
  {
    "name": "长春",
    "lng": 125.18,
    "lat": 43.55
  },
  {
    "name": "柳州",
    "lng": 109.19,
    "lat": 24.2
  },
  {
    "name": "吉林",
    "lng": 126.36,
    "lat": 43.48
  },
  {
    "name": "悟州",
    "lng": 111.18,
    "lat": 23.28
  },
  {
    "name": "哈尔滨",
    "lng": 126.38,
    "lat": 45.45
  },
  {
    "name": "成都",
    "lng": 104.04,
    "lat": 30.39
  },
  {
    "name": "齐齐哈尔",
    "lng": 123.55,
    "lat": 47.22
  },
  {
    "name": "重庆",
    "lng": 106.33,
    "lat": 29.33
  },
  {
    "name": "牡丹江",
    "lng": 129.36,
    "lat": 44.35
  },
  {
    "name": "内江",
    "lng": 105.03,
    "lat": 29.35
  },
  {
    "name": "上海",
    "lng": 121.26,
    "lat": 31.12
  },
  {
    "name": "泸州",
    "lng": 105.27,
    "lat": 28.54
  },
  {
    "name": "南京",
    "lng": 118.46,
    "lat": 32.03
  },
  {
    "name": "万县",
    "lng": 108.22,
    "lat": 30.48
  },
  {
    "name": "无锡",
    "lng": 120.18,
    "lat": 31.35
  },
  {
    "name": "贵阳",
    "lng": 106.43,
    "lat": 26.34
  },
  {
    "name": "苏州",
    "lng": 120.39,
    "lat": 31.2
  },
  {
    "name": "遵义",
    "lng": 106.53,
    "lat": 27.45
  },
  {
    "name": "徐州",
    "lng": 117.12,
    "lat": 34.16
  },
  {
    "name": "昆明",
    "lng": 102.42,
    "lat": 25.03
  },
  {
    "name": "杭州",
    "lng": 120.1,
    "lat": 30.15
  },
  {
    "name": "拉萨",
    "lng": 91.02,
    "lat": 29.39
  },
  {
    "name": "宁波",
    "lng": 121.34,
    "lat": 29.53
  },
  {
    "name": "日喀则",
    "lng": 88.49,
    "lat": 29.16
  },
  {
    "name": "温州",
    "lng": 120.38,
    "lat": 28
  },
  {
    "name": "西安",
    "lng": 108.55,
    "lat": 34.15
  },
  {
    "name": "金华",
    "lng": 119.49,
    "lat": 29.1
  },
  {
    "name": "宝鸡",
    "lng": 107.09,
    "lat": 34.21
  },
  {
    "name": "合肥",
    "lng": 117.16,
    "lat": 31.51
  },
  {
    "name": "延安",
    "lng": 109.26,
    "lat": 36.35
  },
  {
    "name": "芜湖",
    "lng": 118.2,
    "lat": 31.21
  },
  {
    "name": "兰州",
    "lng": 103.5,
    "lat": 36.03
  },
  {
    "name": "安庆",
    "lng": 117.02,
    "lat": 30.32
  },
  {
    "name": "天水",
    "lng": 105.33,
    "lat": 34.35
  },
  {
    "name": "福州",
    "lng": 119.19,
    "lat": 26.02
  },
  {
    "name": "酒泉",
    "lng": 98.3,
    "lat": 39.44
  },
  {
    "name": "厦门",
    "lng": 118.04,
    "lat": 24.26
  },
  {
    "name": "西宁",
    "lng": 101.49,
    "lat": 36.37
  },
  {
    "name": "泉州",
    "lng": 118.37,
    "lat": 24.54
  },
  {
    "name": "银川",
    "lng": 106.13,
    "lat": 38.28
  },
  {
    "name": "南昌",
    "lng": 115.53,
    "lat": 28.41
  },
  {
    "name": "乌鲁木齐",
    "lng": 87.36,
    "lat": 43.46
  },
  {
    "name": "九江",
    "lng": 115.59,
    "lat": 29.43
  },
  {
    "name": "哈密",
    "lng": 93.27,
    "lat": 42.5
  },
  {
    "name": "赣州",
    "lng": 114.56,
    "lat": 25.51
  },
  {
    "name": "喀什",
    "lng": 75.59,
    "lat": 39.27
  },
  {
    "name": "济南",
    "lng": 117.02,
    "lat": 36.4
  },
  {
    "name": "和田",
    "lng": 79.55,
    "lat": 37.07
  },
  {
    "name": "烟台",
    "lng": 121.2,
    "lat": 37.33
  },
  {
    "name": "台北",
    "lng": 121.31,
    "lat": 25.02
  }
]